package HashMap练习题;
/*
 * 题目：春运买票
问题描述：题目：春运期间，成千上万的外出人员都往家赶。
火车站售票窗前买票队伍一眼望不到头。
运气好，碰到一个已在排队的朋友，直接走过去，
排在他后面，这就叫“插队”，但对于队伍里的其他人来说是不公平的。
本题目的任务是写一个程序模拟这种情况。每个队伍都允许插队。
如果你在排队，有一个以上的朋友要求插队，
则你可以安排他们的次序。每次一个入队，
并且如果这个入队的人发现队伍中有自己的朋友，
则可以插入到这个朋友的后面；
当队伍中的朋友不止一个的时候，这个人会排在最后一个朋友的后面；如果队伍中没有朋友，
则他只能排在这个队伍的最后面。每一个入队的都先进行上述的判断。当队伍前面的人买到车票之后。依次出队。

输入要求
程序从“input.txt”文件中读取输入信息，这个文件包含了多个测试用例。每个用例的第一行是朋友组的数目n(1≤n≤1000)。
对于一个朋友组以朋友的数目j (1≤j≤1000)开始，
由朋友的个数以及他们的名字组成，一个空格后接组朋友的名字，
以空格分开，并且每个人的名字都不同。每个名字不超过四个字母，由{A,B,…,Z,a,b,…z}组成。
一个朋友组最多1000人，每个人只属于一个朋友组。n=0时，测试数据结束。 下面是一些具体命令：
ENQUEUE X——X入队
DEQUEUE ——排队头的人买票，离开队伍，即出队
STOP—— 一个测试用例结束
 */

public class homewrok5 {

	public homewrok5() {
		// TODO 自动生成的构造函数存根
	}

}
